arduino/Arduino/hardware/msp430/cores/msp430/twi.c
/*
  ************************************************************************
  *	twi.c
  *
  *	Arduino core files for MSP430
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *
  ***********************************************************************
  Derived from:
  twi.c - TWI/I2C library for Wiring & Arduino
  Copyright (c) 2006 Nicholas Zambetti.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include <math.h>
#include <stdlib.h>
#include "Energia.h" // for digitalWrite
 
#ifndef cbi
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
#endif

#ifndef sbi
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#endif

#include "wiring_private.h"
#include "pins_energia.h"
#include "twi.h"
#include "usci_isr_handler.h"

static volatile uint8_t twi_state;
static volatile uint8_t twi_sendStop;           // should the transaction end with a stop
static volatile uint8_t twi_inRepStart;         // in the middle of a repeated start

static void (*twi_onSlaveTransmit)(void);
static void (*twi_onSlaveReceive)(uint8_t*, int);

static uint8_t twi_masterBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_masterBufferIndex;
static uint8_t twi_masterBufferLength;

static uint8_t twi_txBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_txBufferIndex;
static volatile uint8_t twi_txBufferLength;
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) \
 || defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B0__)
static uint8_t twi_rxBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_rxBufferIndex;
#endif

static volatile uint8_t twi_error;

#ifdef __MSP430_HAS_USI__
static uint8_t twi_slarw;
static uint8_t twi_my_addr;
#endif




#if defined(UCB0CTLW0_) || defined(UCB1CTLW0_)
/* #if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__) \
  || defined(__MSP430_HAS_EUSCI_B0__)|| defined(__MSP430_HAS_EUSCI_B1__)
*/

#if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_EUSCI_B0__)
#define UCB0_BASE UCB0CTLW0_
#endif
#if defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B1__)
#define UCB1_BASE UCB1CTLW0_
#endif
  
#define UCBxCTLW0     (*((volatile uint16_t *)((uint16_t)(I2C_baseAddress + UCB0CTLW0_  - UCB0_BASE))))
#define UCBxCTLW1     (*((volatile uint16_t *)((uint16_t)(I2C_baseAddress + UCB0CTLW1_  - UCB0_BASE))))
#define UCBxCTL0      (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0CTLW0_+1- UCB0_BASE))))
#define UCBxCTL1      (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0CTLW0_  - UCB0_BASE))))
#define UCBxBRW       (*((volatile uint16_t *)((uint16_t)(I2C_baseAddress + UCB0BRW_    - UCB0_BASE))))
#define UCBxBR0       (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0BRW_    - UCB0_BASE))))
#define UCBxBR1       (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0BRW_+1  - UCB0_BASE))))
#define UCBxMCTL      (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0MCTL_   - UCB0_BASE))))
#define UCBxMCTLW     (*((volatile uint16_t *)((uint16_t)(I2C_baseAddress + UCB0MCTLW_  - UCB0_BASE))))
#define UCBxSTAT      (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0STAT_   - UCB0_BASE))))
#define UCBxTBCNT     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0TBCNT_  - UCB0_BASE))))
#define UCBxRXBUF     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0RXBUF_  - UCB0_BASE))))
#define UCBxTXBUF     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0TXBUF_  - UCB0_BASE))))
#define UCBxABCTL     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0ABCTL_  - UCB0_BASE))))
#define UCBxIRCTL     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0IRCTL_  - UCB0_BASE))))
#define UCBxIRTCTL    (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0IRTCTL_ - UCB0_BASE))))
#define UCBxIRRCTL    (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0IRRCTL_ - UCB0_BASE))))
//#define UCBxICTL      (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0ICTL_   - UCB0_BASE))))
#define UCBxI2COA     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0I2COA_  - UCB0_BASE))))
#define UCBxI2COA0    (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0I2COA0_ - UCB0_BASE))))
#define UCBxI2CSA     (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0I2CSA_  - UCB0_BASE))))
#ifdef UCB0ICTL_
#define UCBxIE        (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0ICTL_   - UCB0_BASE))))
#define UCBxIFG       (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0ICTL_+1 - UCB0_BASE))))
#else
#define UCBxIE        (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0IE_     - UCB0_BASE))))
#define UCBxIFG       (*((volatile uint8_t  *)((uint16_t)(I2C_baseAddress + UCB0IFG_    - UCB0_BASE))))
#endif
#define UCBxI2CIE     (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0I2CIE_  - UCB0_BASE)))) 
#define UCBxIV        (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0IV_     - UCB0_BASE)))) 


#else // #if defined(UCB0CTLW0_)

#if defined __MSP430_HAS_USCI__
#define UCB0_BASE UCB0CTL0_
#define UCB1_BASE UCB1CTL0_

#define UCBxCTL0      (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0CTL0_   - UCB0_BASE)))) 
#define UCBxCTL1      (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0CTL1_   - UCB0_BASE)))) 
#define UCBxBR0       (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0BR0_    - UCB0_BASE)))) 
#define UCBxBR1       (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0BR1_    - UCB0_BASE)))) 
#define UCBxMCTL      (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0MCTL_   - UCB0_BASE)))) 
#define UCBxSTAT      (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0STAT_   - UCB0_BASE)))) 
#define UCBxRXBUF     (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0RXBUF_  - UCB0_BASE)))) 
#define UCBxTXBUF     (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0TXBUF_  - UCB0_BASE)))) 
//#define UCBxICTL      (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0ICTL_   - UCB0_BASE)))) 
#define UCBxI2COA     (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0I2COA_  - UCB0_BASE)))) 
#define UCBxI2CSA     (*((volatile uint8_t *)((uint16_t)(I2C_baseAddress + UCB0I2CSA_  - UCB0_BASE)))) 

#define UCxIE         UC0IE
#define UCBxI2CIE     UC0IE
#define UCxIFG        UC0IFG
#ifdef UCB1RXIE
#define UCBxRXIE      UCB0RXIE  ? (I2C_baseAddress == UCB0_BASE) : UCB1RXIE
#define UCBxRXIFG     UCB0RXIFG ? (I2C_baseAddress == UCB0_BASE) : UCB1RXIFG
#else
#define UCBxRXIE      UCB0RXIE
#define UCBxRXIFG     UCB0RXIFG
#endif
#ifdef UCB1TXIE
#define UCBxTXIE      UCB0TXIE  ? (I2C_baseAddress == UCB0_BASE) : UCB1TXIE
#define UCBxTXIFG     UCB0TXIFG ? (I2C_baseAddress == UCB0_BASE) : UCB1TXIFG
#else
#define UCBxTXIE      UCB0TXIE
#define UCBxTXIFG     UCB0TXIFG
#endif


#endif //#if defined __MSP430_HAS_USCI__
#endif // #if defined(UCB0CTLW0_) || defined(UCB1CTLW0_)


#if defined __MSP430_HAS_EUSCI_B0__
#endif

#if defined(__MSP430_HAS_USCI__) \
 || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__) \
 || defined(__MSP430_HAS_EUSCI_B0__) || defined(__MSP430_HAS_EUSCI_B1__)

#if DEFAULT_I2C == 0
uint16_t I2C_baseAddress = UCB0_BASE;
#endif
#if DEFAULT_I2C == 1
uint16_t I2C_baseAddress = UCB1_BASE;
#endif

#endif



