arduino/Arduino/hardware/msp430/cores/msp430/twi.c
void twi_setModule(uint8_t _i2cModule)
{
	if (_i2cModule == 0)
	{
#if defined(__MSP430_HAS_USCI_B0__)|| defined(__MSP430_HAS_EUSCI_B0__)
		I2C_baseAddress = UCB0_BASE;
#endif
	}
	if (_i2cModule == 1)
	{
#if defined(__MSP430_HAS_USCI_B1__)|| defined(__MSP430_HAS_EUSCI_B1__)
		I2C_baseAddress = UCB1_BASE;
#endif
	}
}
/*
 * Function twi_init
 * Desc     readys twi pins and sets twi bitrate
 * Input    none
 * Output   none
 */
void twi_init(void)
{
	// initialize state
	twi_state = TWI_IDLE;
	twi_sendStop = true;		// default value
	twi_inRepStart = false;

#ifdef __MSP430_HAS_USI__

	/* 100 KHz for all */
#if (F_CPU >= 16000000L) || (F_CPU >= 12000000L)
	USICKCTL = USIDIV_7;
#elif defined(CALBC1_8MHZ_) && (F_CPU >= 8000000L)
	USICKCTL = USIDIV_6;
#elif defined(CALBC1_1MHZ_) && (F_CPU >= 1000000L)
	USICKCTL = USIDIV_3;
#endif
	/* Enable USI I2C mode. */
	USICTL1 = USII2C;
	/* SDA/SCL port enable and hold in reset */
	USICTL0 = (USIPE6 | USIPE7 | USISWRST);
	/* SMCLK and SCL inactive state is high */
	USICKCTL |= (USISSEL_2 | USICKPL);
	/* Disable automatic clear control */
	USICNT |= USIIFGCC;
	/* Enable USI */
	USICTL0 &= ~USISWRST;
	/* Counter interrupt enable */
	USICTL1 |= USIIE;
#endif

#if defined(__MSP430_HAS_USCI__) \
 || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)

    /* Calling this dummy function prevents the linker
     * from stripping the USCI interupt vectors.*/ 
    usci_isr_install();

#if defined(__MSP430_HAS_USCI__)
	pinMode_int(TWISDA, TWISDA_SET_MODE);
	pinMode_int(TWISCL, TWISCL_SET_MODE);
#endif
#if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B0__)
	if (I2C_baseAddress == UCB0_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA0, INPUT_PULLUP);
		if (digitalRead(TWISDA0) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL0, INPUT_PULLUP);
			digitalWrite(TWISCL0, LOW);
			pinMode(TWISCL0, OUTPUT);
			pinMode_int(TWISCL0, INPUT_PULLUP);
		}
		if ((TWISDA0_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA0, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL0, INPUT);
		}
		pinMode_int(TWISDA0, TWISDA0_SET_MODE);
		pinMode_int(TWISCL0, TWISCL0_SET_MODE);
	}
#endif
#if defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B1__)
	if (I2C_baseAddress == UCB1_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA1, INPUT_PULLUP);
		if (digitalRead(TWISDA1) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL1, INPUT_PULLUP);
			digitalWrite(TWISCL1, LOW);
			pinMode(TWISCL1, OUTPUT);
			pinMode_int(TWISCL1, INPUT_PULLUP);
		}
		if ((TWISDA1_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA1, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL1, INPUT);
		}
		pinMode_int(TWISDA1, TWISDA1_SET_MODE);
		pinMode_int(TWISCL1, TWISCL1_SET_MODE);
	}
#endif

    //Disable the USCI module and clears the other bits of control register
    UCBxCTL1 = UCSWRST;

     /*
     * Configure as I2C Slave.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode
     * UCCLK = SMCLK
     */
    UCBxCTL0 = UCMODE_3 | UCSYNC;
    /*
     * Compute the clock divider that achieves less than or
     * equal to 100kHz.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    UCBxBR0 = (unsigned char)((F_CPU / TWI_FREQ) & 0xFF);
    UCBxBR1 = (unsigned char)((F_CPU / TWI_FREQ) >> 8);

    UCBxCTL1 &= ~(UCSWRST);

#if defined(__MSP430_HAS_USCI__)
    /* Set I2C state change interrupt mask */
    UCBxI2CIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE);
    /* Enable state change and TX/RX interrupts */
    UCxIE |= UCBxRXIE | UCBxTXIE;
#else
    /* Set I2C state change interrupt mask and TX/RX interrupts */
    UCBxIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE|UCRXIE|UCTXIE);
#endif
#endif
#if defined(__MSP430_HAS_EUSCI_B0__) || defined(__MSP430_HAS_EUSCI_B1__)
#if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_EUSCI_B0__)
	if (I2C_baseAddress == UCB0_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA0, INPUT_PULLUP);
		if (digitalRead(TWISDA0) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL0, INPUT_PULLUP);
			digitalWrite(TWISCL0, LOW);
			pinMode(TWISCL0, OUTPUT);
			pinMode_int(TWISCL0, INPUT_PULLUP);
		}
		if ((TWISDA0_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA0, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL0, INPUT);
		}
		pinMode_int(TWISDA0, TWISDA0_SET_MODE);
		pinMode_int(TWISCL0, TWISCL0_SET_MODE);
	}
#endif
#if defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B1__)
	if (I2C_baseAddress == UCB1_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA1, INPUT_PULLUP);
		if (digitalRead(TWISDA1) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL1, INPUT_PULLUP);
			digitalWrite(TWISCL1, LOW);
			pinMode(TWISCL1, OUTPUT);
			pinMode_int(TWISCL1, INPUT_PULLUP);
		}
		if ((TWISDA1_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA1, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL1, INPUT);
		}
		pinMode_int(TWISDA1, TWISDA1_SET_MODE);
		pinMode_int(TWISCL1, TWISCL1_SET_MODE);
	}
#endif    //Disable the USCI module and clears the other bits of control register
    UCBxCTLW0 = UCSWRST;

    //Configure Automatic STOP condition generation
    UCBxCTLW1 &= ~UCASTP_3;

    /*
     * Configure as I2C master mode.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode (read/write 1 for eUSCI_B)
     * UCCLK = SMCLK
     */
    UCBxCTLW0 = UCMODE_3 | UCSSEL__SMCLK | UCSYNC | UCSWRST;

    /*
     * Compute the clock divider that achieves the fastest speed less than or
     * equal to the desired speed.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    UCBxBRW = (unsigned short)(F_CPU / 400000);
    UCBxCTLW0 &= ~(UCSWRST);
    UCBxIE |= (UCRXIE0|UCTXIE0|UCSTTIE|UCSTPIE); // Enable I2C interrupts
#endif
}

